doc/html/05-05-utilitarios.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="pt-br" xml:lang="pt-br">
<head>
<!-- 2022-10-23 dom 23:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Utilitários</title>
<meta name="author" content="Lucas S. Vieira" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./main.css" />
<link rel="stylesheet" type="text/css" href="./syntax.css" />
<link id="theme-css" rel="stylesheet" type="text/css" href="./dark-theme.css" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta property="og:image" content="../img/cat-i-mage.jpg">
<meta name="theme-color" content="#14171e">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="05-axiomas.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Utilitários</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgbf0a9bc">1. Constantes para aumento de Call Stack</a></li>
<li><a href="#org110b541">2. Máximo divisor comum</a></li>
<li><a href="#org8c94f29">3. Simplificação de frações</a></li>
<li><a href="#org5bcc82e">4. Criação de símbolos a partir de símbolos crus</a></li>
<li><a href="#org8e41df9">5. Truncagem de formatação</a></li>
<li><a href="#orgc6f287f">6. Impressão apropriada de pontos flutuantes</a></li>
</ul>
</div>
</div>
<p>
Arquivo: <code>axioms/utils.rs</code>.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">use</span> <span style="color: #569cd6;">gc</span>::<span style="color: #4ec9b0;">Gc</span>;
<span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">core</span>::<span style="color: #4ec9b0;">Maj</span>;
<span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::maj_list;
<span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #4ec9b0;">MajRawSym</span>;
</pre>
</div>

<div id="outline-container-orgbf0a9bc" class="outline-2">
<h2 id="orgbf0a9bc"><span class="section-number-2">1.</span> Constantes para aumento de Call Stack</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">const</span> <span style="color: #9cdcfe;">STACK_RED_ZONE</span>: <span style="color: #4ec9b0;">usize</span>      = 100 * 1024;      <span style="color: #6a9955;">// </span><span style="color: #6a9955;">100KB</span>
<span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">const</span> <span style="color: #9cdcfe;">STACK_PER_RECURSION</span>: <span style="color: #4ec9b0;">usize</span> = 9 * 1024 * 1024; <span style="color: #6a9955;">// </span><span style="color: #6a9955;">9MB</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org110b541" class="outline-2">
<h2 id="org110b541"><span class="section-number-2">2.</span> Máximo divisor comum</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">gcd</span>(<span style="color: #9cdcfe;">a</span>: <span style="color: #4ec9b0;">i64</span>, <span style="color: #9cdcfe;">b</span>: <span style="color: #4ec9b0;">i64</span>) -&gt; <span style="color: #4ec9b0;">i64</span> {
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">a</span> = a;
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">b</span> = b;
    <span style="color: #569cd6;">while</span> b != 0 {
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">ratio</span> = a % b;
        a = b;
        b = ratio;
    }
    a
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org8c94f29" class="outline-2">
<h2 id="org8c94f29"><span class="section-number-2">3.</span> Simplificação de frações</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">simplify_frac_raw</span>(<span style="color: #9cdcfe;">numer</span>: <span style="color: #4ec9b0;">i64</span>, <span style="color: #9cdcfe;">denom</span>: <span style="color: #4ec9b0;">i64</span>) -&gt; (<span style="color: #4ec9b0;">i64</span>, <span style="color: #4ec9b0;">i64</span>) {
    <span style="color: #569cd6;">if</span> denom == 0 {
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Division by zero is illegal and, if it came</span>
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">to this part of the program, we should panic</span>
        <span style="color: #c586c0;">panic!</span>(<span style="color: #ce9178;">"Division by zero on fraction simplification"</span>);
    }
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">gcd</span> = gcd(numer, denom);
    <span style="color: #569cd6;">let</span> (<span style="color: #569cd6;">mut</span> numer, <span style="color: #569cd6;">mut</span> denom) = (numer / gcd, denom / gcd);
    <span style="color: #569cd6;">if</span> (denom &lt; 0) &amp;&amp; (numer &gt; 0) {
        numer *= -1;
        denom *= -1;
    }
    (numer, denom)
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">simplify_frac</span>(<span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Result</span>&lt;<span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;, <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;&gt; {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">predicates</span>::maj_fractionp;
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::{
        maj_numer,
        maj_denom,
        maj_err,
    };
    <span style="color: #569cd6;">if</span> !maj_fractionp(x.clone()).to_bool() {
        <span style="color: #4ec9b0;">Err</span>(maj_err(<span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a fraction"</span>),
                    <span style="color: #c586c0;">maj_list!</span>(x)))
    } <span style="color: #569cd6;">else</span> {
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">numer</span> = maj_numer(x.clone()).to_integer().unwrap();
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">denom</span> = maj_denom(x.clone()).to_integer().unwrap();
        <span style="color: #569cd6;">if</span> denom == 0 {
            <span style="color: #4ec9b0;">Err</span>(maj_err(<span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"Division by zero"</span>),
                        <span style="color: #4ec9b0;">Maj</span>::nil()))
        } <span style="color: #569cd6;">else</span> {
            <span style="color: #569cd6;">let</span> (numer, denom) = simplify_frac_raw(numer, denom);
            <span style="color: #4ec9b0;">Ok</span>(<span style="color: #4ec9b0;">Maj</span>::fraction(numer, denom))
        }
    }
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">simplify_frac_coerce</span>(<span style="color: #9cdcfe;">x</span>: <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;) -&gt; <span style="color: #4ec9b0;">Result</span>&lt;<span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;, <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt;&gt; {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::{maj_numer, maj_denom };
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">frac</span> = simplify_frac(x)<span style="color: #c586c0; font-weight: bold;">?</span>;
    <span style="color: #4ec9b0;">Ok</span>(<span style="color: #569cd6;">if</span> maj_denom(frac.clone()).to_integer().unwrap() == 1 {
        maj_numer(frac)
    } <span style="color: #569cd6;">else</span> {
        frac
    })
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org5bcc82e" class="outline-2">
<h2 id="org5bcc82e"><span class="section-number-2">4.</span> Criação de símbolos a partir de símbolos crus</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">sym_from_raw</span>(<span style="color: #9cdcfe;">raw</span>: <span style="color: #4ec9b0;">MajRawSym</span>) -&gt; <span style="color: #4ec9b0;">Gc</span>&lt;<span style="color: #4ec9b0;">Maj</span>&gt; {
    <span style="color: #4ec9b0;">Gc</span>::new(<span style="color: #4ec9b0;">Maj</span>::<span style="color: #4ec9b0;">Sym</span>(raw <span style="color: #569cd6;">as</span> <span style="color: #4ec9b0;">u64</span>))
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org8e41df9" class="outline-2">
<h2 id="org8e41df9"><span class="section-number-2">5.</span> Truncagem de formatação</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">truncate_format</span>(<span style="color: #9cdcfe;">text</span>: <span style="color: #4ec9b0;">String</span>, <span style="color: #9cdcfe;">max</span>: <span style="color: #4ec9b0;">usize</span>) -&gt; <span style="color: #4ec9b0;">String</span> {
    <span style="color: #569cd6;">if</span> max &lt; 4 || text.len() &lt;= max {
        text
    } <span style="color: #569cd6;">else</span> {
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">slice</span> = <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>text[..(max - 4)];
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">should_close</span> =
            slice.chars().nth(0).unwrap() == <span style="color: #ce9178;">'('</span>;
        <span style="color: #c586c0;">format!</span>(<span style="color: #ce9178;">"</span><span style="color: #ce9178; font-style: italic;">{}{}{}</span><span style="color: #ce9178;">"</span>,
                slice,
                <span style="color: #ce9178;">"..."</span>,
                <span style="color: #569cd6;">if</span> should_close { <span style="color: #ce9178;">")"</span> } <span style="color: #569cd6;">else</span> { <span style="color: #ce9178;">""</span> })
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc6f287f" class="outline-2">
<h2 id="orgc6f287f"><span class="section-number-2">6.</span> Impressão apropriada de pontos flutuantes</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">pub</span> <span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">format_raw_float</span>(<span style="color: #9cdcfe;">num</span>: <span style="color: #4ec9b0;">f64</span>) -&gt; <span style="color: #4ec9b0;">String</span> {
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">buffer</span> = <span style="color: #c586c0;">format!</span>(<span style="color: #ce9178;">"</span><span style="color: #ce9178; font-style: italic;">{}</span><span style="color: #ce9178;">"</span>, num);
    <span style="color: #569cd6;">if</span> buffer.find(<span style="color: #ce9178;">'.'</span>).is_none() {
        buffer.push(<span style="color: #ce9178;">'.'</span>);
        buffer.push(<span style="color: #ce9178;">'0'</span>);
    }
    buffer
}
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Lucas S. Vieira</p>
<p class="date">Created: 2022-10-23 dom 23:28</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
